# Core Development Tools
brew 'neovim'
brew 'tmux'
brew 'git'
brew 'gh'
brew 'lazygit'

# Shell & Terminal Enhancements
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'starship'

# Modern CLI Tools
brew 'fzf'
brew 'ripgrep'
brew 'fd'
brew 'zoxide'
brew 'bat'
brew 'eza'
brew 'delta'
brew 'jq'
brew 'yq'

# File Formatters & Linters
brew 'shfmt'
brew 'stylua'
brew 'prettier'

# System Utilities
brew 'curl'
brew 'wget'
brew 'htop'
brew 'btop'
brew 'tldr'
brew 'tree'

# Programming Languages & Runtimes
brew 'python'
brew 'nvm'
brew 'php'
brew 'composer'
brew 'java'

# Databases
brew 'mysql'
brew 'sqlite'

# Web Services
brew 'nginx'
brew 'dnsmasq'

# Performance & Testing
brew 'k6'

# GUI Applications - Productivity
cask 'alfred'
cask 'maccy'
cask 'hammerspoon'
cask 'slack'
cask 'discord'

# GUI Applications - Development
cask 'kitty'
cask 'claude-code'
cask 'docker-desktop'
cask 'tableplus'
cask 'visual-studio-code'
cask 'webstorm'
cask 'phpstorm'
cask 'postman'

# GUI Applications - Browsers
cask 'arc'

# GUI Applications - Media & Entertainment
cask 'spotify'
cask 'obs'

# Mac App Store Applications (optional)
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
