# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'

# Fuzzy search
brew 'fzf'
brew 'ripgrep'

# Git
brew 'git'
brew 'gh'
brew 'lazygit'

brew 'tree'

# File formatters
brew 'shfmt'
brew 'stylua'

# utils
brew 'curl'
brew 'wget'
brew 'htop'

brew 'python'
brew 'tmux'
brew 'neovim'
brew 'zsh-syntax-highlighting'

brew 'nvm'
brew 'nginx'
brew 'php'
brew 'java'
brew 'sqlite'
brew 'composer'
brew 'dnsmasq'
brew 'figlet'
brew 'lolcat'

# Cask
cask 'slack'
cask 'discord'
cask 'tableplus'
cask 'docker'
cask 'maccy'
cask 'alfred'
cask 'hammerspoon'
cask 'kitty'
cask 'brave-browser'
cask 'spotify'
cask 'visual-studio-code'
cask 'webstorm'
cask 'phpstorm'
cask 'obs'
